Hi,

I think I have similar error.
My code:

```terraform
locals {
  netboot_files = fileset("${path.module}/templates/netboot.xyz/tftp/", "**")
}

resource "routeros_file" "netboot" {
  for_each = {
    for file in local.netboot_files :
    file => file
  }

  name = "${var.routeros_disk_name}/${each.key}"

  contents = file("${path.module}/templates/netboot.xyz/tftp/${each.key}")
}
```

It deploys fine. Problem is when I change content one of the files and then apply:

```bash
Terraform will perform the following actions:

  # routeros_file.netboot["bootstrap.sh"] must be replaced
-/+ resource "routeros_file" "netboot" {
      ~ contents             = <<-EOT # forces replacement
          ...            
        EOT
      + creation_time        = (known after apply)
      ~ id                   = "*/1000FE2111757362312F626F6F7473747261702E7368" -> (known after apply)
      ~ last_modified        = "2025-11-25 14:52:57" -> (known after apply)
        name                 = "usb1/bootstrap.sh"
      + package_architecture = (known after apply)
      + package_built_time   = (known after apply)
      + package_name         = (known after apply)
      + package_version      = (known after apply)
      ~ size                 = 1789 -> (known after apply)
      ~ type                 = ".sh file" -> (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

routeros_file.netboot["bootstrap.sh"]: Destroying... [id=*/1000FE2111757362312F626F6F7473747261702E7368]
╷
│ Error: DELETE 'http://router.lan/rest/file/*/1000FE2111757362312F626F6F7473747261702E7368' returned response code: 400, message: 'Bad Request', details: 'missing or invalid resource identifier'
│ 
│ 
╵

Process finished with exit code 1
```